app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "text", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "a"], ["text", "a"], ["user_id", 2], ["created_at", "2022-11-24 17:41:04.384617"], ["updated_at", "2022-11-24 17:41:04.384617"]]
---
  def create
    @micropost = Micropost.new(micropost_params)

    respond_to do |format|
      if @micropost.save